SaitovSP/src/Documents/ЗакрытиеСмены/ЗакрытиеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеСмены</name>
  <registerRecords>AccumulationRegister.ДенежныеСредстваСети</registerRecords>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

SaitovSP/src/Documents/ЗакрытиеСмены/ManagerModule.bsl
Процедура РедактированиеДокументаЗакрытиеСмены (ПередаваемыйОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(ПередаваемыйОбъект.Номер) Тогда
	
		НовыйДокумент 			= Документы.ЗакрытиеСмены.СоздатьДокумент();
		НовыйДокумент.Дата 		= ПередаваемыйОбъект.Дата;
		НовыйДокумент.Ресторан 	= ПередаваемыйОбъект.Ресторан;
		НовыйДокумент.Сумма 	= ПередаваемыйОбъект.Сумма;
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		
		РедактируемыйДокумент 						= ПередаваемыйОбъект.Ссылка.ПолучитьОбъект();
		РедактируемыйДокумент.Дата 		= ПередаваемыйОбъект.Дата;
		РедактируемыйДокумент.Ресторан 	= ПередаваемыйОбъект.Ресторан;
		РедактируемыйДокумент.Сумма 	= ПередаваемыйОбъект.Сумма;
		РедактируемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	

	
КонецПроцедуры
